---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape
source: html/daaa1d33-7ee8-738a-5ab7-b93f056deaf8.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape

Shapes for structural sections.

## Syntax (C#)
```csharp
public enum StructuralSectionShape
```

## Remarks
Allow safely differentiate between classes inherited from Autodesk::Revit::DB::Structure::StructuralSections::StructuralSection class.